// проверить значение counter через всё приложение
// проверить что все добавленные товары передаются через все приложение
// проверить что товар добавленный из страницы продукта, отображается в корзине
// проверить что товар добавленный из страницы продукта отображается как добавленный на странице всех товаров
// проверить что цена товара одинаковая через все приложение
// проверить что после логаута, при повторном логине добавленные товары остаются добавленными
// проверить что после логаута, при повторном логине количество добавленных товаров в каунтер остается